{"vllm":0,"code":1,"conduct":2,"our":3,"pledge":4,"we":5,"members":6,"contributors":7,"leaders":8,"make":9,"participation":10,"community":11,"harassment":12,"free":13,"experience":14,"everyone":15,"regardless":16,"age":17,"body":18,"size":19,"visible":20,"invisible":21,"disability":22,"ethnicity":23,"sex":24,"characteristics":25,"gender":26,"identity":27,"expression":28,"level":29,"education":30,"socioeconomic":31,"status":32,"nationality":33,"personal":34,"appearance":35,"race":36,"caste":37,"color":38,"religion":39,"sexual":40,"orientation":41,"act":42,"interact":43,"ways":44,"contribute":45,"open":46,"welcoming":47,"diverse":48,"inclusive":49,"healthy":50,"standards":51,"examples":52,"behavior":53,"contributes":54,"positive":55,"environment":56,"include":57,"demonstrating":58,"empathy":59,"kindness":60,"toward":61,"other":62,"people":63,"being":64,"respectful":65,"differing":66,"opinions":67,"viewpoints":68,"experiences":69,"giving":70,"gracefully":71,"accepting":72,"constructive":73,"feedback":74,"responsibility":75,"apologizing":76,"those":77,"affected":78,"mistakes":79,"learning":80,"from":81,"focusing":82,"what":83,"best":84,"just":85,"us":86,"individuals":87,"overall":88,"unacceptable":89,"use":90,"sexualized":91,"language":92,"imagery":93,"attention":94,"advances":95,"any":96,"kind":97,"trolling":98,"insulting":99,"derogatory":100,"comments":101,"political":102,"attacks":103,"public":104,"private":105,"publishing":106,"others":107,"information":108,"physical":109,"email":110,"address":111,"without":112,"explicit":113,"permission":114,"which":115,"could":116,"reasonably":117,"considered":118,"inappropriate":119,"professional":120,"setting":121,"enforcement":122,"responsibilities":123,"responsible":124,"clarifying":125,"enforcing":126,"acceptable":127,"take":128,"appropriate":129,"fair":130,"corrective":131,"action":132,"response":133,"deem":134,"threatening":135,"offensive":136,"harmful":137,"have":138,"right":139,"remove":140,"edit":141,"reject":142,"commits":143,"wiki":144,"edits":145,"issues":146,"contributions":147,"aligned":148,"communicate":149,"reasons":150,"moderation":151,"decisions":152,"when":153,"scope":154,"applies":155,"within":156,"all":157,"spaces":158,"also":159,"individual":160,"officially":161,"representing":162,"using":163,"official":164,"posting":165,"via":166,"social":167,"media":168,"account":169,"acting":170,"appointed":171,"representative":172,"online":173,"offline":174,"irl":175,"event":176,"instances":177,"abusive":178,"harassing":179,"otherwise":180,"may":181,"reported":182,"channel":183,"slack":184,"https":185,"ai":186,"complaints":187,"reviewed":188,"investigated":189,"promptly":190,"fairly":191,"obligated":192,"respect":193,"privacy":194,"security":195,"reporter":196,"incident":197,"guidelines":198,"follow":199,"impact":200,"determining":201,"consequences":202,"violation":203,"correction":204,"deemed":205,"unprofessional":206,"unwelcome":207,"consequence":208,"written":209,"warning":210,"providing":211,"clarity":212,"around":213,"nature":214,"explanation":215,"why":216,"apology":217,"requested":218,"through":219,"single":220,"series":221,"actions":222,"continued":223,"interaction":224,"involved":225,"including":226,"unsolicited":227,"specified":228,"period":229,"time":230,"includes":231,"avoiding":232,"interactions":233,"well":234,"external":235,"channels":236,"like":237,"violating":238,"terms":239,"lead":240,"temporary":241,"permanent":242,"ban":243,"serious":244,"sustained":245,"sort":246,"communication":247,"allowed":248,"during":249,"pattern":250,"aggression":251,"disparagement":252,"classes":253,"attribution":254,"adapted":255,"contributor":256,"covenant":257,"www":258,"org":259,"version":260,"available":261,"v2":262,"code_of_conduct":263,"html":264,"were":265,"inspired":266,"mozilla":267,"ladder":268,"github":269,"com":270,"inclusion":271,"answers":272,"common":273,"questions":274,"about":275,"see":276,"faq":277,"translations":278,"spdx":279,"license":280,"identifier":281,"apache":282,"filecopyrighttext":283,"copyright":284,"project":285,"import":286,"glob":287,"requires_files":288,"requirements":289,"txt":290,"pyproject":291,"toml":292,"file":293,"print":294,"cleaning":295,"lines":296,"readlines":297,"torch":298,"join":299,"lower":300,"removed":301,"line":302,"write":303,"else":304,"strip":305,"done":306,"markdownlint":307,"disable":308,"md001":309,"md041":310,"align":311,"center":312,"picture":313,"source":314,"prefers":315,"scheme":316,"dark":317,"srcset":318,"raw":319,"githubusercontent":320,"main":321,"docs":322,"assets":323,"logos":324,"logo":325,"text":326,"png":327,"img":328,"alt":329,"src":330,"light":331,"width":332,"55":333,"h3":334,"easy":335,"fast":336,"cheap":337,"llm":338,"serving":339,"href":340,"documentation":341,"blog":342,"arxiv":343,"abs":344,"2309":345,"06180":346,"paper":347,"vllm_project":348,"twitter":349,"discuss":350,"user":351,"forum":352,"developer":353,"latest":354,"news":355,"2025":356,"08":357,"hosted":358,"beijing":359,"meetup":360,"mp":361,"weixin":362,"qq":363,"dgkwg1wfpwgo2jcdtqqhxa":364,"large":365,"scale":366,"deployment":367,"please":368,"find":369,"slides":370,"here":371,"drive":372,"google":373,"folders":374,"1pid6nsflu43dzri0eatcpgxsazdvbbqf":375,"recording":376,"chaspark":377,"live":378,"1166916873711665152":379,"05":380,"nyc":381,"lu":382,"ma":383,"c1rqyf1f":384,"presentation":385,"1_q_aw_iomjwuimf1s1ym":386,"zhjxz8cuel0ijvaquoybea":387,"usp":388,"sharing":389,"now":390,"under":391,"pytorch":392,"foundation":393,"announcement":394,"xz8cuel0ijvaquoybea":395,"welcomes":396,"01":397,"excited":398,"announce":399,"alpha":400,"release":401,"v1":402,"major":403,"architectural":404,"upgrade":405,"7x":406,"speedup":407,"clean":408,"optimized":409,"execution":410,"loop":411,"zero":412,"overhead":413,"prefix":414,"caching":415,"enhanced":416,"multimodal":417,"support":418,"more":419,"check":420,"out":421,"post":422,"27":423,"details":424,"summary":425,"previous":426,"04":427,"asia":428,"day":429,"sginnovate":430,"limited":431,"availability":432,"morning":433,"evening":434,"slots":435,"remaining":436,"inaugural":437,"team":438,"19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo":439,"03":440,"ollama":441,"inference":442,"night":443,"16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u":444,"first":445,"china":446,"n77gibl2coratqhtveazfg":447,"1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq":448,"east":449,"coast":450,"7mu4k4xx":451,"he":452,"o4c8j5wpgzv0bkylwnhyq":453,"1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs":454,"slide":455,"id":456,"g31441846c39_0_0":457,"02":458,"ninth":459,"h7g3kuj9":460,"meta":461,"1jzc_pzvxrvnsfvcw":462,"v4cfxb6pn7zz2cyp_flwo05aqg":463,"amd":464,"1zk5qejiktmlq2eqcxqzlljax3m9s7nwn":465,"view":466,"posted":467,"eighth":468,"zep56hui":469,"cloud":470,"1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4":471,"1h24phewanyrl11xy5dxubvrc9f9kkjix":472,"2024":473,"12":474,"joins":475,"ecosystem":476,"11":477,"seventh":478,"h0qvrajz":479,"snowflake":480,"1e3cxqbv3jsfgp30swyvs3em_tw":481,"ghohj9pajgk6kr54":482,"1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a":483,"10":484,"created":485,"coordinating":486,"discussing":487,"features":488,"feel":489,"ray":490,"summit":491,"held":492,"special":493,"track":494,"opening":495,"talk":496,"1b_kqxphbtra_mdf":497,"tr6i8rwdou5qotznceg2mkzxehm":498,"learn":499,"talks":500,"youtube":501,"playlist":502,"list":503,"plztswpqnepxl6aqwifuwuimlpfrvpksjr":504,"users":505,"09":506,"sixth":507,"87q3nvnh":508,"nvidia":509,"1wrlgwytqfaotd5wcgspnhoaw3nq0e":510,"9wqyp7ny93xrs":511,"07":512,"fifth":513,"lp0gyjqr":514,"aws":515,"1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y":516,"partnership":517,"supports":518,"llama":519,"fp8":520,"quantization":521,"pipeline":522,"parallelism":523,"23":524,"llama31":525,"06":526,"fourth":527,"agivllm":528,"cloudflare":529,"bentoml":530,"1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4":531,"third":532,"robloxandvllmmeetup2024":533,"splashthat":534,"roblox":535,"1a":536,"47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem":537,"second":538,"ygxbpzhl":539,"ibm":540,"12mi2skabnuw5rbwxdyy":541,"hthth4imsnceoq10jdqbxga":542,"2023":543,"a16z":544,"1ql":545,"xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s":546,"would":547,"express":548,"sincere":549,"gratitude":550,"andreessen":551,"horowitz":552,"30":553,"supporting":554,"generous":555,"grant":556,"development":557,"research":558,"released":559,"fastchat":560,"integration":561,"has":562,"powered":563,"lmsys":564,"vicuna":565,"chatbot":566,"arena":567,"chat":568,"since":569,"mid":570,"april":571,"library":572,"originally":573,"developed":574,"sky":575,"computing":576,"lab":577,"cs":578,"berkeley":579,"edu":580,"uc":581,"evolved":582,"driven":583,"both":584,"academia":585,"industry":586,"state":587,"art":588,"throughput":589,"efficient":590,"management":591,"key":592,"value":593,"memory":594,"pagedattention":595,"20":596,"continuous":597,"batching":598,"incoming":599,"requests":600,"model":601,"cuda":602,"hip":603,"graph":604,"quantizations":605,"gptq":606,"2210":607,"17323":608,"awq":609,"2306":610,"00978":611,"autoround":612,"05516":613,"int4":614,"int8":615,"kernels":616,"flashattention":617,"flashinfer":618,"speculative":619,"decoding":620,"chunked":621,"prefill":622,"flexible":623,"seamless":624,"popular":625,"hugging":626,"face":627,"models":628,"high":629,"various":630,"algorithms":631,"parallel":632,"sampling":633,"beam":634,"search":635,"tensor":636,"data":637,"expert":638,"distributed":639,"streaming":640,"outputs":641,"openai":642,"compatible":643,"api":644,"server":645,"gpus":646,"cpus":647,"intel":648,"powerpc":649,"tpu":650,"neuron":651,"multi":652,"lora":653,"seamlessly":654,"most":655,"huggingface":656,"transformer":657,"llms":658,"mixture":659,"mixtral":660,"deepseek":661,"v3":662,"embedding":663,"e5":664,"mistral":665,"modal":666,"llava":667,"full":668,"supported":669,"en":670,"supported_models":671,"getting":672,"started":673,"install":674,"pip":675,"getting_started":676,"installation":677,"gpu":678,"index":679,"build":680,"wheel":681,"bash":682,"visit":683,"quickstart":684,"contributing":685,"welcome":686,"collaborations":687,"how":688,"get":689,"sponsors":690,"compute":691,"resources":692,"testing":693,"following":694,"organizations":695,"thank":696,"you":697,"your":698,"note":699,"them":700,"alphabetical":701,"order":702,"keep":703,"consistent":704,"md":705,"cash":706,"donations":707,"dropbox":708,"sequoia":709,"capital":710,"skywork":711,"zhenfund":712,"alibaba":713,"anyscale":714,"crusoe":715,"databricks":716,"deepinfra":717,"lambda":718,"nebius":719,"novita":720,"replicate":721,"runpod":722,"trainy":723,"san":724,"diego":725,"sponsor":726,"fundraising":727,"venue":728,"opencollective":729,"plan":730,"fund":731,"maintenance":732,"adoption":733,"citation":734,"cite":735,"bibtex":736,"inproceedings":737,"kwon2023efficient":738,"title":739,"author":740,"woosuk":741,"kwon":742,"zhuohan":743,"li":744,"siyuan":745,"zhuang":746,"ying":747,"sheng":748,"lianmin":749,"zheng":750,"cody":751,"hao":752,"yu":753,"joseph":754,"gonzalez":755,"zhang":756,"ion":757,"stoica":758,"booktitle":759,"proceedings":760,"acm":761,"sigops":762,"29th":763,"symposium":764,"operating":765,"systems":766,"principles":767,"year":768,"contact":769,"start":770,"technical":771,"feature":772,"fellow":773,"disclosures":774,"advisories":775,"partnerships":776,"lists":777,"mailto":778,"end":779,"kit":780,"wish":781,"refer":782,"repo":783,"releasing":784,"releases":785,"offer":786,"reliable":787,"base":788,"packaged":789,"binary":790,"format":791,"can":792,"conveniently":793,"accessed":794,"pypi":795,"serve":796,"milestones":797,"newly":798,"improvements":799,"upcoming":800,"changes":801,"affect":802,"potential":803,"breaking":804,"versioning":805,"uses":806,"shifted":807,"where":808,"new":809,"patch":810,"every":811,"weeks":812,"contain":813,"bug":814,"fixes":815,"opposed":816,"semver":817,"contains":818,"only":819,"backwards":820,"critical":821,"need":822,"made":823,"post1":824,"_major_":825,"milestone":826,"incompatible":827,"similar":828,"_minor_":829,"_patch_":830,"_post1_":831,"_patch":832,"1_":833,"either":834,"implicit":835,"cadence":836,"bi":837,"weekly":838,"basis":839,"days":840,"after":841,"same":842,"branch":843,"future":844,"dates":845,"below":846,"tentative":847,"optional":848,"date":849,"versions":850,"jan":851,"feb":852,"mar":853,"apr":854,"jun":855,"jul":856,"13":857,"aug":858,"14":859,"15":860,"sep":861,"16":862,"17":863,"oct":864,"18":865,"19":866,"nov":867,"21":868,"dec":869,"22":870,"each":871,"built":872,"dedicated":873,"cut":874,"performed":875,"before":876,"previously":877,"reused":878,"builds":879,"triggered":880,"push":881,"rc":882,"tag":883,"vx":884,"rc1":885,"enables":886,"test":887,"multiple":888,"rcs":889,"final":890,"does":891,"trigger":892,"used":893,"notes":894,"monitor":895,"reverts":896,"apply":897,"cherry":898,"pick":899,"criteria":900,"approach":901,"finalizing":902,"clear":903,"picks":904,"process":905,"land":906,"pr":907,"typically":908,"ensure":909,"sufficient":910,"complete":911,"thorough":912,"round":913,"stable":914,"regression":915,"functional":916,"performance":917,"against":918,"recent":919,"severe":920,"issue":921,"silent":922,"incorrectness":923,"compatibility":924,"crashes":925,"deadlocks":926,"leaks":927,"introduced":928,"specific":929,"change":930,"identifiers":931,"ci":932,"work":933,"prs":934,"merged":935,"trunk":936,"exception":937,"manual":938,"validations":939,"e2e":940,"validation":941,"perform":942,"regressions":943,"benchmark":944,"workflow":945,"workflows":946,"yml":947,"current":948,"coverage":949,"llama3":950,"llama4":951,"hardware":952,"h100":953,"mi300x":954,"_note":955,"based":956,"availability_":957,"step":958,"access":959,"request":960,"repository":961,"run":962,"review":963,"setup":964,"familiarize":965,"yourself":966,"configurations":967,"tree":968,"benchmarks":969,"rocm":970,"navigate":971,"configure":972,"set":973,"v0":974,"commit":975,"hash":976,"results":977,"once":978,"completes":979,"dashboard":980,"hud":981,"reponame":982,"2fvllm":983,"corresponding":984,"comparison":985,"compare":986,"verify":987,"occurred":988,"example":989,"vs":990,"starttime":991,"thu":992,"2c":993,"2017":994,"20apr":995,"202025":996,"2021":997,"3a43":998,"3a50":999,"20gmt":1000,"stoptime":1001,"wed":1002,"2016":1003,"20jul":1004,"granularity":1005,"week":1006,"lbranch":1007,"lcommit":1008,"b6553be1bc75f046b00046a4ad7576364d03c835":1009,"rbranch":1010,"rcommit":1011,"a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f":1012,"benchmarkname":1013,"modelname":1014,"20models":1015,"backendname":1016,"20backends":1017,"modename":1018,"20modes":1019,"dtypename":1020,"20dtype":1021,"devicename":1022,"20devices":1023,"archname":1024,"20platforms":1025,"def":1026,"load_module_from_path":1027,"module_name":1028,"path":1029,"spec":1030,"importlib":1031,"util":1032,"spec_from_file_location":1033,"module":1034,"module_from_spec":1035,"sys":1036,"modules":1037,"loader":1038,"exec_module":1039,"return":1040,"is_sccache_available":1041,"bool":1042,"sccache":1043,"none":1044,"int":1045,"os":1046,"getenv":1047,"vllm_disable_sccache":1048,"is_ccache_available":1049,"ccache":1050,"is_ninja_available":1051,"ninja":1052,"is_url_available":1053,"url":1054,"str":1055,"urllib":1056,"urlopen":1057,"try":1058,"except":1059,"false":1060,"200":1061,"class":1062,"cmakeextension":1063,"extension":1064,"__init__":1065,"self":1066,"name":1067,"cmake_lists_dir":1068,"kwa":1069,"super":1070,"sources":1071,"py_limited_api":1072,"true":1073,"abspath":1074,"cmake_build_ext":1075,"build_ext":1076,"dict":1077,"directories":1078,"been":1079,"configured":1080,"did_config":1081,"determine":1082,"number":1083,"compilation":1084,"jobs":1085,"optionally":1086,"nvcc":1087,"compile":1088,"threads":1089,"compute_num_jobs":1090,"num_jobs":1091,"max_jobs":1092,"variable":1093,"defined":1094,"envs":1095,"logger":1096,"info":1097,"sched_getaffinity":1098,"isn":1099,"universally":1100,"so":1101,"fall":1102,"back":1103,"cpu_count":1104,"error":1105,"len":1106,"attributeerror":1107,"nvcc_threads":1108,"_is_cuda":1109,"get_nvcc_cuda_version":1110,"reduce":1111,"avoid":1112,"overloading":1113,"system":1114,"max":1115,"cmake":1116,"configuration":1117,"ext":1118,"ve":1119,"already":1120,"cmakelists":1121,"exit":1122,"early":1123,"select":1124,"type":1125,"optimization":1126,"debug":1127,"default_cfg":1128,"relwithdebinfo":1129,"cfg":1130,"cmake_build_type":1131,"cmake_args":1132,"dcmake_build_type":1133,"dvllm_target_device":1134,"vllm_target_device":1135,"verbose":1136,"dcmake_verbose_makefile":1137,"dcmake_c_compiler_launcher":1138,"dcmake_cxx_compiler_launcher":1139,"dcmake_cuda_compiler_launcher":1140,"dcmake_hip_compiler_launcher":1141,"elif":1142,"auncher":1143,"pass":1144,"python":1145,"executable":1146,"exact":1147,"match":1148,"dvllm_python_executable":1149,"reuse":1150,"dependencies":1151,"subsequent":1152,"calls":1153,"dvllm_python_path":1154,"override":1155,"directory":1156,"fetchcontent":1157,"downloads":1158,"root":1159,"deps":1160,"allows":1161,"between":1162,"profiles":1163,"plays":1164,"nicely":1165,"fetchcontent_base_dir":1166,"fc_base_dir":1167,"root_dir":1168,"environ":1169,"dfetchcontent_base_dir":1170,"tool":1171,"dnvcc_threads":1172,"build_tool":1173,"dcmake_job_pool_compile":1174,"string":1175,"dcmake_job_pools":1176,"default":1177,"whatever":1178,"sure":1179,"cuda_home":1180,"dcmake_cuda_compiler":1181,"bin":1182,"subprocess":1183,"check_call":1184,"cwd":1185,"build_temp":1186,"build_extensions":1187,"present":1188,"working":1189,"check_output":1190,"oserror":1191,"raise":1192,"runtimeerror":1193,"cannot":1194,"create":1195,"exist":1196,"exists":1197,"makedirs":1198,"targets":1199,"target_name":1200,"removeprefix":1201,"vllm_flash_attn":1202,"extensions":1203,"append":1204,"build_args":1205,"elf":1206,"target":1207,"libraries":1208,"proper":1209,"location":1210,"outdir":1211,"get_ext_fullpath":1212,"parent":1213,"absolute":1214,"skip":1215,"continue":1216,"appends":1217,"range":1218,"count":1219,"should":1220,"actually":1221,"components":1222,"install_args":1223,"component":1224,"standard":1225,"command":1226,"copy":1227,"py":1228,"build_lib":1229,"th":1230,"ompile":1231,"included":1232,"editable":1233,"files":1234,"recursive":1235,"dst_file":1236,"split":1237,"copying":1238,"dirname":1239,"exist_ok":1240,"copy_file":1241,"precompiled_build_ext":1242,"disables":1243,"building":1244,"precompiled":1245,"binaries":1246,"assert":1247,"vllm_use_precompiled":1248,"skipping":1249,"precompiled_wheel_utils":1250,"extracts":1251,"existing":1252,"staticmethod":1253,"extract_precompiled_and_patch_package":1254,"wheel_url_or_path":1255,"tempfile":1256,"zipfile":1257,"temp_dir":1258,"isfile":1259,"wheel_filename":1260,"mkdtemp":1261,"wheels":1262,"wheel_path":1263,"downloading":1264,"urlretrieve":1265,"filename":1266,"package_data_patch":1267,"files_to_copy":1268,"_c":1269,"abi3":1270,"_moe_c":1271,"_flashmla_c":1272,"_vllm_fa2_c":1273,"_vllm_fa3_c":1274,"cumem_allocator":1275,"compiled_regex":1276,"re":1277,"file_me":1278,"file_members":1279,"filter":1280,"filelist":1281,"extract":1282,"target_path":1283,"wb":1284,"dst":1285,"shutil":1286,"copyfileobj":1287,"pkg":1288,"replace":1289,"setdefault":1290,"basename":1291,"finally":1292,"removing":1293,"rmtree":1294,"get_base_commit_in_main_branch":1295,"force":1296,"nightly":1297,"mainly":1298,"vllm_test_use_precompiled_nightly_wheel":1299,"upstream":1300,"resp_json":1301,"curl":1302,"repos":1303,"decode":1304,"utf":1305,"upstream_main_commit":1306,"json":1307,"loads":1308,"sha":1309,"docker":1310,"context":1311,"git":1312,"immutable":1313,"missing":1314,"vllm_docker_build_context":1315,"local":1316,"cat":1317,"calledprocesserror":1318,"fetch":1319,"remote":1320,"update":1321,"branches":1322,"ensures":1323,"ref":1324,"its":1325,"history":1326,"current_branch":1327,"urrent":1328,"show":1329,"base_commit":1330,"merge":1331,"valueerror":1332,"err":1333,"failed":1334,"dev":1335,"_no_device":1336,"empty":1337,"has_cuda":1338,"_is_neuron":1339,"_is_tpu":1340,"_is_hip":1341,"_is_cpu":1342,"cpu":1343,"_is_xpu":1344,"xpu":1345,"_build_custom_ops":1346,"get_rocm_version":1347,"rocm_home":1348,"librocm":1349,"core":1350,"blob":1351,"d11f5c20d500f729c393680a01fa902ebf92094b":1352,"rocm_version":1353,"cpp":1354,"l21":1355,"librocm_core_file":1356,"lib":1357,"is_file":1358,"librocm_core":1359,"ctypes":1360,"cdll":1361,"vererrors":1362,"c_uint32":1363,"get_rocm_core_version":1364,"getrocmversion":1365,"restype":1366,"argtypes":1367,"pointer":1368,"minor":1369,"byref":1370,"get_neuronxcc_version":1371,"sysconfig":1372,"site_dir":1373,"get_paths":1374,"purelib":1375,"version_file":1376,"neuronxcc":1377,"executed":1378,"successfully":1379,"fp":1380,"content":1381,"read":1382,"regular":1383,"__version__":1384,"group":1385,"output":1386,"apex":1387,"8b7a1ff183741dd8f9b87e7bafd04cfde99cea28":1388,"nvcc_output":1389,"universal_newlines":1390,"release_idx":1391,"nvcc_cuda_version":1392,"parse":1393,"get_gaudi_sw_version":1394,"returns":1395,"driver":1396,"enable":1397,"console":1398,"printing":1399,"hl":1400,"smi":1401,"shell":1402,"capture_output":1403,"env":1404,"enable_console":1405,"returncode":1406,"stdout":1407,"get_vllm_version":1408,"get_version":1409,"write_to":1410,"_version":1411,"might":1412,"cuda_version":1413,"main_cuda_version":1414,"cuda_version_str":1415,"tarball":1416,"required":1417,"sdist":1418,"argv":1419,"cu":1420,"neuron_version":1421,"neuron_version_str":1422,"runtimeerro":1423,"unknown":1424,"runtime":1425,"get_requirements":1426,"package":1427,"requirements_dir":1428,"_read_requirements":1429,"resolved_requirements":1430,"startswith":1431,"cuda_major":1432,"cuda_minor":1433,"modified_requirements":1434,"req":1435,"flash":1436,"attn":1437,"unsupported":1438,"platform":1439,"ompiler_launcher":1440,"_is":1441,"pref":1442,"ake":1443,"policy":1444,"reporting":1445,"report":1446,"privately":1447,"vulnerability":1448,"submission":1449,"form":1450,"triage":1451,"reports":1452,"triaged":1453,"vulnerability_management":1454,"threat":1455,"guide":1456,"usage":1457,"assumptions":1458,"recommendations":1459,"securely":1460,"severity":1461,"risk":1462,"taking":1463,"dealing":1464,"past":1465,"defaults":1466,"cases":1467,"categories":1468,"vulnerabilities":1469,"allow":1470,"attackers":1471,"execute":1472,"arbitrary":1473,"control":1474,"significantly":1475,"compromise":1476,"confidentiality":1477,"integrity":1478,"privileges":1479,"needed":1480,"network":1481,"deserialization":1482,"exploit":1483,"chains":1484,"generally":1485,"rated":1486,"cvss":1487,"flaws":1488,"elevated":1489,"rce":1490,"contexts":1491,"significant":1492,"loss":1493,"require":1494,"advanced":1495,"conditions":1496,"some":1497,"trust":1498,"modes":1499,"node":1500,"privileged":1501,"scores":1502,"moderate":1503,"cause":1504,"denial":1505,"service":1506,"partial":1507,"disruption":1508,"do":1509,"breach":1510,"rating":1511,"low":1512,"informational":1513,"logging":1514,"errors":1515,"non":1516,"exploitable":1517,"weaknesses":1518,"privilege":1519,"negligible":1520,"side":1521,"collisions":1522,"often":1523,"less":1524,"than":1525,"prenotification":1526,"certain":1527,"prenotify":1528,"vendors":1529,"ship":1530,"purpose":1531,"coordinated":1532,"notification":1533,"adding":1534,"contacts":1535,"advisory":1536,"few":1537,"added":1538,"send":1539,"vendor":1540,"analyzed":1541,"case":1542,"withdraw":1543,"receiving":1544,"prenotifications":1545,"membership":1546,"refinements":1547,"who":1548,"find_cuda_init":1549,"fn":1550,"callable":1551,"object":1552,"helper":1553,"function":1554,"initialization":1555,"initializes":1556,"prints":1557,"stack":1558,"trace":1559,"happens":1560,"_lazy_init":1561,"wrapper":1562,"nonlocal":1563,"traceback":1564,"extract_stack":1565,"initialized":1566,"format_list":1567,"is_allowed_file":1568,"current_file":1569,"allowed_files":1570,"is_forbidden_import":1571,"stripped":1572,"forbidden_import_re":1573,"allowed_lines":1574,"parse_diff":1575,"diff":1576,"violations":1577,"current_lineno":1578,"skip_allowed_file":1579,"splitlines":1580,"next":1581,"code_line":1582,"get_diff":1583,"diff_type":1584,"staged":1585,"cached":1586,"unified":1587,"unstaged":1588,"all_violations":1589,"diff_output":1590,"extend":1591,"stderr":1592,"forbidden":1593,"direct":1594,"triton":1595,"detected":1596,"triton_utils":1597,"instead":1598,"get_staged_python_files":1599,"result":1600,"am":1601,"endswith":1602,"forbidden_patterns":1603,"allowed_patterns":1604,"check_file":1605,"filepath":1606,"tuple":1607,"encoding":1608,"line_num":1609,"enumerate":1610,"unicodedecodeerror":1611,"total_violations":1612,"found":1613,"regex":1614,"noqa":1615,"e501":1616,"imports":1617,"generates":1618,"specialized":1619,"script":1620,"reads":1621,"input":1622,"splits":1623,"two":1624,"nightly_torch_test":1625,"related":1626,"torch_nightly_test":1627,"packages":1628,"input_file":1629,"output_file":1630,"white":1631,"directly":1632,"add":1633,"dependency":1634,"fails":1635,"white_list":1636,"torchaudio":1637,"torchvision":1638,"mamba_ssm":1639,"skip_next":1640,"get_python_executable":1641,"get_cpu_cores":1642,"cores":1643,"multiprocessing":1644,"generate_presets":1645,"output_path":1646,"cmakeuserpresets":1647,"attempting":1648,"detect":1649,"nvcc_path":1650,"prospective_path":1651,"utils":1652,"cpp_extension":1653,"nvcc_path_input":1654,"automatically":1655,"provide":1656,"usr":1657,"python_executable":1658,"python_executable_prompt":1659,"virtual":1660,"home":1661,"venvs":1662,"manually":1663,"cpu_cores":1664,"min":1665,"cmake_jobs":1666,"assuming":1667,"tools":1668,"project_root":1669,"__file__":1670,"resolvable":1671,"isabs":1672,"cache_variables":1673,"cmake_cuda_compiler":1674,"vllm_python_executable":1675,"cmake_install_prefix":1676,"sourcedir":1677,"cmake_cuda_flags":1678,"nvcc_thre":1679,"compiler":1680,"cache":1681,"launcher":1682,"cxx":1683,"cmake_":1684,"_compiler_launcher":1685,"configure_preset":1686,"binarydir":1687,"cachevariables":1688,"generator":1689,"cmake_job_pools":1690,"slower":1691,"presets":1692,"sync":1693,"cmakeminimumrequired":1694,"26":1695,"configurepresets":1696,"buildpresets":1697,"configurepreset":1698,"output_file_path":1699,"overwrite":1700,"generation":1701,"cancelled":1702,"dump":1703,"indent":1704,"generated":1705,"nto":1706,"preset":1707,"cd":1708,"initialize":1709,"writing":1710,"is_python_file":1711,"scan_file":1712,"pickle_re":1713,"load_gitignore":1714,"repo_root":1715,"gitignore_path":1716,"gitignore":1717,"patterns":1718,"always":1719,"ignore":1720,"pathspec":1721,"from_lines":1722,"gitwildmatch":1723,"bad_files":1724,"dirpath":1725,"filenames":1726,"walk":1727,"abs_path":1728,"rel_path":1729,"relpath":1730,"ignored":1731,"match_file":1732,"nerror":1733,"pickle":1734,"cloudpickle":1735,"nif":1736,"intentional":1737,"check_pickle_imports":1738,"test_regex":1739,"test_cases":1740,"pkl":1741,"cpkl":1742,"dumps":1743,"timport":1744,"somethingelse":1745,"pickleas":1746,"asdf":1747,"should_match":1748,"expected":1749,"got":1750,"tests":1751,"passed":1752,"_is_internal":1753,"_fail":1754,"iterable":1755,"disallowed":1756,"eager":1757,"lineno":1758,"msg":1759,"init_path":1760,"read_text":1761,"ast":1762,"visitor":1763,"nodevisitor":1764,"_in_type_checking":1765,"visit_if":1766,"guard_is_type_checking":1767,"isinstance":1768,"attribute":1769,"typing":1770,"attr":1771,"type_checking":1772,"prev":1773,"child":1774,"orelse":1775,"generic_visit":1776,"visit_import":1777,"alias":1778,"names":1779,"allowed_im":1780,"ames":1781,"allowed_imports":1782,"must":1783,"inside":1784,"visit_importfrom":1785,"importfrom":1786,"module_as_written":1787,"allowed_from_modules":1788,"get_attr_docs":1789,"cls_node":1790,"classdef":1791,"docstrings":1792,"placed":1793,"assignments":1794,"davidism":1795,"mit":1796,"pairwise":1797,"implement":1798,"itertools":1799,"dropped":1800,"iterator":1801,"iter":1802,"yield":1803,"consider":1804,"pair":1805,"nodes":1806,"assignment":1807,"constant":1808,"assign":1809,"annassign":1810,"expr":1811,"doc":1812,"inspect":1813,"cleandoc":1814,"annotated":1815,"one":1816,"assigning":1817,"plain":1818,"configvalidator":1819,"visit_classdef":1820,"validate":1821,"config":1822,"dataclass":1823,"decorators":1824,"decorator_list":1825,"call":1826,"func":1827,"validate_class":1828,"fail":1829,"decorator":1830,"class_node":1831,"attr_docs":1832,"stmt":1833,"field":1834,"annotation":1835,"classvar":1836,"dataclasses":1837,"variables":1838,"subscript":1839,"field_name":1840,"docstring":1841,"union":1842,"slice":1843,"args":1844,"elts":1845,"literal_args":1846,"arg":1847,"isins":1848,"literal":1849,"literal1":1850,"literal2":1851,"validate_ast":1852,"validate_file":1853,"file_path":1854,"validating":1855,"systemexit":1856,"message":1857,"represents":1858,"ninja_log":1859,"creates":1860,"passing":1861,"times":1862,"seconds":1863,"float":1864,"appended":1865,"owner":1866,"weighted_duration":1867,"duration":1868,"task":1869,"setweightedduration":1870,"sets":1871,"weightedduration":1872,"weighted":1873,"takes":1874,"elapsed":1875,"divides":1876,"many":1877,"tasks":1878,"running":1879,"thus":1880,"approximate":1881,"total":1882,"serialized":1883,"serializing":1884,"steps":1885,"ending":1886,"up":1887,"much":1888,"longer":1889,"durations":1890,"shorter":1891,"modest":1892,"floating":1893,"point":1894,"epsilon":1895,"000002":1896,"dur":1897,"uration":1898,"describetargets":1899,"printable":1900,"summarizes":1901,"generate":1902,"dozens":1903,"handle":1904,"sanely":1905,"max_length":1906,"chosen":1907,"fit":1908,"long":1909,"while":1910,"minimizing":1911,"word":1912,"wrapping":1913,"65":1914,"readtargets":1915,"log":1916,"show_all":1917,"log_file":1918,"sorted":1919,"objects":1920,"header":1921,"readline":1922,"v5":1923,"unrecognized":1924,"targets_dict":1925,"last_end_seen":1926,"parts":1927,"exe":1928,"rudely":1929,"halted":1930,"corrupt":1931,"silently":1932,"cmdhash":1933,"restart":1934,"convert":1935,"integral":1936,"milliseconds":1937,"1000":1938,"earlier":1939,"stamp":1940,"means":1941,"possibly":1942,"incremental":1943,"throw":1944,"away":1945,"displayed":1946,"independently":1947,"comparing":1948,"because":1949,"records":1950,"commands":1951,"guaranteed":1952,"ts_dict":1953,"several":1954,"row":1955,"go":1956,"last":1957,"however":1958,"repeated":1959,"changed":1960,"stop":1961,"points":1962,"identified":1963,"reset":1964,"dictionary":1965,"values":1966,"getextension":1967,"extra_patterns":1968,"important":1969,"canonical":1970,"ultimately":1971,"goal":1972,"fn_pattern":1973,"fnmatch":1974,"good":1975,"grouping":1976,"type_mappings":1977,"break":1978,"capture":1979,"javac":1980,"jar":1981,"distinguished":1982,"interface":1983,"ext1":1984,"splitext":1985,"ext2":1986,"preserve":1987,"pdb":1988,"dll":1989,"pefile":1990,"linking":1991,"grouped":1992,"together":1993,"don":1994,"listed":1995,"toc":1996,"attempt":1997,"identify":1998,"identifying":1999,"obj":2000,"categorized":2001,"inking":2002,"mojo":2003,"jars":2004,"java":2005,"normalize":2006,"mojom":2007,"summarizeentries":2008,"entries":2009,"extra_step_types":2010,"beginning":2011,"due":2012,"starting":2013,"stopping":2014,"exactly":2015,"iterate":2016,"keeping":2017,"calculate":2018,"ends":2019,"own":2020,"easily":2021,"calculated":2022,"task_start_stop_times":2023,"earliest":2024,"total_cpu_time":2025,"length":2026,"weighted_total":2027,"happen":2028,"starts":2029,"stops":2030,"come":2031,"alphabet":2032,"making":2033,"correctly":2034,"currently":2035,"tart":2036,"running_tasks":2037,"record":2038,"processed":2039,"know":2040,"deltas":2041,"last_time":2042,"accumulated":2043,"efficiently":2044,"last_weighted_time":2045,"scan":2046,"events":2047,"action_name":2048,"accumulate":2049,"num_running":2050,"moment":2051,"ran":2052,"del":2053,"warn":2054,"sum":2055,"off":2056,"half":2057,"weig":2058,"_time":2059,"500":2060,"possible":2061,"untrustworthy":2062,"3f":2063,"entries_by_ext":2064,"defaultdict":2065,"items":2066,"longest":2067,"long_count":2068,"1f":2069,"completed":2070,"average":2071,"2f":2072,"parser":2073,"argparse":2074,"argumentparser":2075,"add_argument":2076,"dest":2077,"build_directory":2078,"help":2079,"types":2080,"semicolon":2081,"separated":2082,"analyze":2083,"_extra_args":2084,"parse_known_args":2085,"step_types":2086,"room":2087,"extra":2088,"global":2089,"long_ext_count":2090,"errno":2091,"enoent":2092,"spdxstatus":2093,"enum":2094,"enumeration":2095,"missing_license":2096,"missing_copyright":2097,"missing_both":2098,"check_spdx_header_status":2099,"shebang":2100,"start_idx":2101,"has_license":2102,"has_copyright":2103,"headers":2104,"license_line":2105,"copyright_line":2106,"completely":2107,"add_header":2108,"supplement":2109,"seek":2110,"truncate":2111,"full_spdx_header":2112,"writelines":2113,"insert":2114,"files_missing_both":2115,"files_missing_copyright":2116,"files_missing_license":2117,"collect":2118,"fixing":2119,"all_files_to_fix":2120,"python3":2121,"hipify":2122,"preprocessor":2123,"hipify_torch":2124,"dir":2125,"hipify_python":2126,"__name__":2127,"__main__":2128,"project_dir":2129,"hipified":2130,"output_dir":2131,"nargs":2132,"parse_args":2133,"limit":2134,"extra_files":2135,"hold":2136,"copytree":2137,"dirs_exist_ok":2138,"hipify_result":2139,"project_directory":2140,"output_directory":2141,"header_include_dirs":2142,"show_detailed":2143,"is_pytorch_extension":2144,"hipify_extra_files_only":2145,"hipified_sources":2146,"s_abs":2147,"hipified_s_abs":2148,"hipified_path":2149,"get_default_cache_root":2150,"xdg_cache_home":2151,"expanduser":2152,"get_default_config_root":2153,"xdg_config_home":2154,"maybe_convert_int":2155,"maybe_convert_bool":2156,"get_vllm_port":2157,"port":2158,"vllm_port":2159,"integer":2160,"raises":2161,"uri":2162,"suggest":2163,"k8s":2164,"discovery":2165,"urlparse":2166,"parsed":2167,"appears":2168,"caused":2169,"kubernetes":2170,"env_vars":2171,"valid":2172,"__getattr__":2173,"lazy":2174,"evaluation":2175,"environment_variables":2176,"__dir__":2177,"keys":2178,"is_set":2179,"explicitly":2180,"set_vllm_use_v1":2181,"use_v1":2182,"vllm_use_v1":2183,"compute_hash":2184,"whenever":2185,"factors":2186,"affects":2187,"computation":2188,"different":2189,"vllm_pp_layer_partition":2190,"graphs":2191,"vars":2192,"choice":2193,"backends":2194,"todo":2195,"deftruth":2196,"factorize":2197,"environment_variables_to_hash":2198,"vllm_mla_disable":2199,"vllm_use_triton_flash_attn":2200,"vllm_use_triton_awq":2201,"vllm_dp_rank":2202,"vllm_dp_size":2203,"vllm_use_standalone_compile":2204,"vllm_fused_moe_chunk_size":2205,"vllm_flashinfer_moe_backend":2206,"vllm_v1_use_prefill_decode_attention":2207,"vllm_use_aiter_unified_attention":2208,"vllm_attention_backend":2209,"vllm_use_flashinfer_sampler":2210,"vllm_flashinfer_force_tensor_cores":2211,"vllm_disabled_kernels":2212,"vllm_use_deep_gemm":2213,"vllm_use_trtllm_fp4_gemm":2214,"vllm_use_flashinfer_moe_fp8":2215,"vllm_use_flashinfer_moe_fp4":2216,"vllm_use_flashinfer_moe_mxfp4_mxfp8":2217,"vllm_use_flashinfer_moe_mxfp4_bf16":2218,"vllm_use_c":2219,"vllm_use_cudnn_prefill":2220,"vllm_use_trtllm_attention":2221,"vllm_rocm_use_aiter":2222,"vllm_rocm_use_aiter_paged_attn":2223,"vllm_rocm_use_aiter_linear":2224,"vllm_rocm_use_aiter_moe":2225,"vllm_rocm_use_aiter_rmsnorm":2226,"vllm_rocm_use_aiter_mla":2227,"vllm_rocm_use_aiter_mha":2228,"vllm_rocm_use_skinny_gemm":2229,"vllm_rocm_fp8_padding":2230,"vllm_rocm_moe_padding":2231,"vllm_rocm_custom_paged_attn":2232,"vllm_rocm_quick_reduce_quantization":2233,"vllm_rocm_quick_reduce_cast_bf16_to_fp16":2234,"vllm_rocm_quick_reduce_max_size_bytes_mb":2235,"goes":2236,"hash_str":2237,"hashlib":2238,"md5":2239,"encode":2240,"usedforsecurity":2241,"hexdigest":2242,"models_on_s3":2243,"adept":2244,"fuyu":2245,"8b":2246,"ai21labs":2247,"ai21":2248,"jamba":2249,"mini":2250,"tiny":2251,"random":2252,"reward":2253,"allenai":2254,"molmo":2255,"7b":2256,"0924":2257,"olmo":2258,"1b":2259,"hf":2260,"olmoe":2261,"instruct":2262,"kv":2263,"quark":2264,"amead10":2265,"hmellor":2266,"ilama":2267,"baai":2268,"bge":2269,"multilingual":2270,"gemma2":2271,"reranker":2272,"m3":2273,"bigcode":2274,"starcoder2":2275,"3b":2276,"cross":2277,"encoder":2278,"ms":2279,"marco":2280,"minilm":2281,"quora":2282,"roberta":2283,"vl2":2284,"distilbert":2285,"distilgpt2":2286,"facebook":2287,"bart":2288,"cnn":2289,"fixie":2290,"ultravox":2291,"v0_5":2292,"3_2":2293,"gemma":2294,"2b":2295,"paligemma":2296,"pt":2297,"224":2298,"h2oai":2299,"h2ovl":2300,"mississippi":2301,"800m":2302,"huggingfacem4":2303,"idefics3":2304,"internlm":2305,"internlm2":2306,"1_8b":2307,"intfloat":2308,"small":2309,"jason9693":2310,"qwen2":2311,"5b":2312,"apeach":2313,"onevision":2314,"ov":2315,"video":2316,"11b":2317,"vision":2318,"me":2319,"microsoft":2320,"phi":2321,"4k":2322,"8k":2323,"128k":2324,"moe":2325,"mistralai":2326,"8x7b":2327,"pixtral":2328,"12b":2329,"2409":2330,"8x22b":2331,"modelcloud":2332,"qwen1":2333,"4bits":2334,"dynamic":2335,"lm_head":2336,"symfalse":2337,"symtrue":2338,"tinyllama":2339,"4bit":2340,"25":2341,"neuralmagic":2342,"quantized":2343,"w8a8":2344,"nm":2345,"asym":2346,"w8w8":2347,"static":2348,"per":2349,"llama2":2350,"stories42m":2351,"pruned2":2352,"compressed":2353,"llama7b":2354,"shot":2355,"2_4":2356,"w4a16":2357,"marlin24":2358,"tensors":2359,"2of4":2360,"ia":2361,"weight":2362,"uct":2363,"sym":2364,"skipqkv":2365,"oneshot":2366,"group128":2367,"w8":2368,"a8":2369,"w8a16":2370,"token":2371,"shape":2372,"sparse":2373,"dense":2374,"compressor":2375,"gsm8k":2376,"pruned":2377,"chnl_wts_per_tok_dyn_act_fp8":2378,"bitm":2379,"chnl_wts_per_tok_dyn_act_int8":2380,"chnl_wts_tensor_act_fp8":2381,"chnl_wts_tensor_act":2382,"nyllama":2383,"chnl_wts_tensor_act_int8":2384,"tensor_wts_per_tok_dyn_act_fp8":2385,"tensor_wts_per_tok_dyn_act_int8":2386,"tensor_wts_tensor_act_fp8":2387,"tensor_wts_tensor_act_int8":2388,"nvlm":2389,"72b":2390,"gpt2":2391,"whisper":2392,"openbmb":2393,"minicpm":2394,"2_6":2395,"opengvlab":2396,"internvl2":2397,"parasail":2398,"gritlm":2399,"qwen":2400,"a2":2401,"audio":2402,"vl":2403,"math":2404,"prm":2405,"rm":2406,"royokong":2407,"sentence":2408,"transformers":2409,"stsb":2410,"0425":2411,"shuyuej":2412,"tence":2413,"ssmits":2414,"embed":2415,"stabilityai":2416,"stablelm":2417,"4e1t":2418,"zephyr":2419,"mamba":2420,"130m":2421,"thebloke":2422,"zai":2423,"glm":2424,"4v":2425,"9b":2426,"tiger":2427,"mantis":2428,"siglip":2429,"vlm2vec":2430,"tiiuae":2431,"falcon":2432,"40b":2433,"upstage":2434,"solar":2435,"pro":2436,"preview":2437,"model_weights_s3_bucket":2438,"s3":2439,"weights":2440,"is_otel_available":2441,"_is_otel_imported":2442,"init_tracer":2443,"instrumenting_module_name":2444,"otlp_traces_endpoint":2445,"tracer":2446,"opentelemetry":2447,"unable":2448,"installed":2449,"original":2450,"otel_import_error_traceback":2451,"trace_provider":2452,"tracerprovider":2453,"span_exporter":2454,"get_span_exporter":2455,"add_span_processor":2456,"batchspanprocessor":2457,"set_tracer_provider":2458,"get_tracer":2459,"endpoint":2460,"protocol":2461,"otel_exporter_otlp_traces_protocol":2462,"grpc":2463,"exporter":2464,"otlp":2465,"proto":2466,"trace_exporter":2467,"otlpspanexporter":2468,"http":2469,"protobuf":2470,"extract_trace_context":2471,"mapping":2472,"tracecontexttextmappropagator":2473,"extract_trace_headers":2474,"trace_headers":2475,"spanattributes":2476,"copied":2477,"conflicts":2478,"telemetry":2479,"semantic":2480,"conventions":2481,"gen":2482,"spans":2483,"gen_ai_usage_completion_tokens":2484,"gen_ai":2485,"completion_tokens":2486,"gen_ai_usage_prompt_tokens":2487,"prompt_tokens":2488,"gen_ai_request_max_tokens":2489,"max_tokens":2490,"gen_ai_request_top_p":2491,"top_p":2492,"gen_ai_request_temperature":2493,"temperature":2494,"gen_ai_response_model":2495,"until":2496,"gen_ai_request_id":2497,"gen_ai_request_n":2498,"gen_ai_usage_num_sequences":2499,"num_sequences":2500,"gen_ai_latency_time_in_queue":2501,"latency":2502,"time_in_queue":2503,"gen_ai_latency_time_to_first_token":2504,"time_to_first_token":2505,"gen_ai_latency_e2e":2506,"gen_ai_latency_time_in_scheduler":2507,"time_in_scheduler":2508,"taken":2509,"forward":2510,"across":2511,"workers":2512,"gen_ai_latency_time_in_model_forward":2513,"time_in_model_forward":2514,"block":2515,"gen_ai_latency_time_in_model_execute":2516,"time_in_model_execute":2517,"contains_trace_headers":2518,"log_tracing_disabled_warning":2519,"received":2520,"tracing":2521,"disabled":2522,"basespanattributes":2523,"spankind":2524,"get_bad_words_logits_processors":2525,"bad_words":2526,"tokenizer":2527,"anytokenizer":2528,"logitsprocessor":2529,"bad_words_ids":2530,"bad_word":2531,"prohibit":2532,"words":2533,"middle":2534,"add_prefix_space":2535,"parameter":2536,"prompt":2537,"lstrip":2538,"prompt_token_ids":2539,"add_special_tokens":2540,"space":2541,"produces":2542,"nobadwordslogitsprocessor":2543,"_smallest_logit":2544,"inf":2545,"_neutral_logit":2546,"word_bias":2547,"floattensor":2548,"__call__":2549,"past_tokens_ids":2550,"logits":2551,"_init_word_bias":2552,"last_token_bias":2553,"zeros_like":2554,"bad_word_ids":2555,"prefix_length":2556,"last_token_id":2557,"actual_prefix":2558,"expected_prefix":2559,"is_match":2560,"sequencebiaslogitsprocessor":2561,"noq":2562,"logits_process":2563,"vocab_size":2564,"_check_token_ids_bounds":2565,"zeros":2566,"dtype":2567,"device":2568,"bad_word_id":2569,"invalid_token_ids":2570,"token_id":2571,"vocabulary":2572,"tokens":2573,"bad":2574,"integers":2575,"satisfying":2576,"init_logger":2577,"processes":2578,"called":2579,"nccl_cumem_enable":2580,"increase":2581,"cudagraph":2582,"allreduce":2583,"nccl":2584,"1234":2585,"caps":2586,"imex":2587,"requires":2588,"nvlink":2589,"gb200":2590,"nvl72":2591,"ultimate":2592,"way":2593,"nvml":2594,"apis":2595,"too":2596,"expensive":2597,"approximation":2598,"existence":2599,"still":2600,"cost":2601,"worthwhile":2602,"very":2603,"bandwidth":2604,"pull":2605,"15951":2606,"avoids":2607,"unintentional":2608,"is_available":2609,"pytorch_nvml_based_cuda_check":2610,"10480":2611,"torchinductor_compile_threads":2612,"10619":2613,"_inductor":2614,"compile_threads":2615,"get_args":2616,"generationtask":2617,"transcription":2618,"generation_tasks":2619,"poolingtask":2620,"classify":2621,"score":2622,"pooling_tasks":2623,"supportedtask":2624,"_prev_minor_version_was":2625,"version_str":2626,"whether":2627,"given":2628,"matches":2629,"supplied":2630,"hidden":2631,"metrics":2632,"anything":2633,"__version_tuple__":2634,"won":2635,"thing":2636,"_prev_minor_version":2637,"fine":2638,"samplingtype":2639,"intenum":2640,"greedy":2641,"random_seed":2642,"guideddecodingparams":2643,"fields":2644,"logit":2645,"processor":2646,"grammar":2647,"json_object":2648,"options":2649,"backend":2650,"backend_was_auto":2651,"disable_fallback":2652,"disable_any_whitespace":2653,"disable_additional_properties":2654,"whitespace_pattern":2655,"structural_tag":2656,"from_optional":2657,"basemodel":2658,"schemas":2659,"pydantic":2660,"model_json_schema":2661,"__post_init__":2662,"mutually":2663,"exclusive":2664,"guide_count":2665,"guided":2666,"__dict__":2667,"requestoutputkind":2668,"entire":2669,"far":2670,"requestoutput":2671,"cumulative":2672,"delta":2673,"intermediate":2674,"final_only":2675,"samplingparams":2676,"msgspec":2677,"struct":2678,"omit_defaults":2679,"cached_property":2680,"parameters":2681,"completion":2682,"reference":2683,"completions":2684,"addition":2685,"sequences":2686,"best_of":2687,"top":2688,"returned":2689,"greater":2690,"equal":2691,"_real_n":2692,"presence_penalty":2693,"penalizes":2694,"appear":2695,"encourage":2696,"repeat":2697,"frequency_penalty":2698,"frequency":2699,"repetition_penalty":2700,"gener":2701,"odel":2702,"controls":2703,"randomness":2704,"deterministic":2705,"higher":2706,"probability":2707,"top_k":2708,"min_p":2709,"minimum":2710,"relative":2711,"likely":2712,"seed":2713,"strings":2714,"stop_token_ids":2715,"ids":2716,"unless":2717,"ignore_eos":2718,"igno":2719,"eos":2720,"generating":2721,"maximum":2722,"sequence":2723,"min_tokens":2724,"logprobs":2725,"probabilities":2726,"implementation":2727,"follows":2728,"sampled":2729,"elements":2730,"prompt_logprobs":2731,"exposed":2732,"engine":2733,"returning":2734,"detokenize":2735,"skip_special_tokens":2736,"toke":2737,"spaces_between_special_tokens":2738,"logits_processors":2739,"functions":2740,"modify":2741,"argument":2742,"include_stop_str_in_output":2743,"truncate_prompt_tokens":2744,"ge":2745,"truncation":2746,"left":2747,"output_kind":2748,"supposed":2749,"post_init":2750,"output_text_buffer_length":2751,"_all_stop_token_ids":2752,"default_factory":2753,"construct":2754,"processors":2755,"guided_decoding":2756,"provided":2757,"paramet":2758,"ecoding":2759,"logit_bias":2760,"biases":2761,"allowed_token_ids":2762,"retains":2763,"extra_args":2764,"additional":2765,"custom":2766,"implementations":2767,"plugins":2768,"etc":2769,"precisely":2770,"_bad_words_token_ids":2771,"_p":2772,"clamp":2773,"bias":2774,"100":2775,"ret":2776,"it_bias":2777,"allowed_tok":2778,"deal":2779,"_max_temp":2780,"numerical":2781,"nan":2782,"maxed":2783,"stop_token":2784,"characters":2785,"finished":2786,"_verify_args":2787,"_sampling_eps":2788,"_verify_greedy_sampling":2789,"eos_token_id":2790,"least":2791,"negative":2792,"quietly":2793,"accept":2794,"prefer":2795,"typeerror":2796,"st_id":2797,"stop_str":2798,"update_from_generation_config":2799,"generation_config":2800,"model_eos_token_id":2801,"sampling_params":2802,"processing":2803,"eos_ids":2804,"primary":2805,"handled":2806,"separately":2807,"purposes":2808,"discard":2809,"update_from_tokenizer":2810,"ad_words_token_ids":2811,"bad_words_token_ids":2812,"max_token_id":2813,"er":2814,"sampling_type":2815,"property":2816,"all_stop_token_ids":2817,"internal":2818,"backward":2819,"clone":2820,"deep":2821,"maybe":2822,"nontrivial":2823,"amount":2824,"needs":2825,"3087":2826,"logit_processor_refs":2827,"lp":2828,"hasattr":2829,"deepcopy":2830,"memo":2831,"__repr__":2832,"beamsearchparams":2833,"beam_width":2834,"length_penalty":2835,"logit_bi":2836,"spac":2837,"rompt_logprobs":2838,"valu":2839,"paged_attention_v1":2840,"query":2841,"key_cache":2842,"value_cache":2843,"num_kv_heads":2844,"block_tables":2845,"seq_lens":2846,"block_size":2847,"max_seq_len":2848,"alibi_slopes":2849,"kv_cache_dtype":2850,"k_scale":2851,"v_scale":2852,"tp_rank":2853,"blocksparse_local_blocks":2854,"blocksparse_vert_stride":2855,"blocksparse_block_size":2856,"64":2857,"blocksparse_head_sliding_step":2858,"ops":2859,"paged_attention_v2":2860,"exp_sum":2861,"max_logits":2862,"tmp_out":2863,"paged_attention_rocm":2864,"query_start_loc":2865,"fp8_out_scale":2866,"_rocm_c":2867,"paged_attention":2868,"mla_decode_kvcache_cpu":2869,"kv_cache":2870,"_c_cpu":2871,"mla_decode_kvcache":2872,"merge_attn_states":2873,"prefix_output":2874,"prefix_lse":2875,"suffix_output":2876,"suffix_lse":2877,"output_lse":2878,"convert_vertical_slash_indexes":2879,"q_seqlens":2880,"batch":2881,"kv_seqlens":2882,"vertical_indexes":2883,"n_heads":2884,"nnz_v":2885,"slash_indexes":2886,"nnz_s":2887,"context_size":2888,"block_size_m":2889,"block_size_n":2890,"causal":2891,"batch_size":2892,"num_heads":2893,"nnz_slash":2894,"nnz_vertical":2895,"num_rows":2896,"block_count":2897,"block_offset":2898,"column_count":2899,"column_index":2900,"convert_vertical_slash_indexes_mergehead":2901,"head":2902,"indices":2903,"vertical_indices_count":2904,"slash_indices_count":2905,"rotary_embedding":2906,"positions":2907,"head_size":2908,"cos_sin_cache":2909,"is_neox":2910,"batched_rotary_embedding":2911,"rot_dim":2912,"cos_sin_cache_offsets":2913,"rms_norm":2914,"contiguous":2915,"kernel":2916,"updated":2917,"input_contiguous":2918,"fused_add_rms_norm":2919,"residual":2920,"apply_repetition_penalties_torch":2921,"prompt_mask":2922,"output_mask":2923,"repetition_penalties":2924,"unsqueeze":2925,"dim":2926,"op":2927,"penalties":2928,"divide":2929,"penalty":2930,"multiply":2931,"scaling":2932,"apply_repetition_penalties_cuda":2933,"apply_repetition_penalties_":2934,"apply_repetition_penalties":2935,"repetition":2936,"place":2937,"num_seqs":2938,"boolean":2939,"indicating":2940,"is_cuda":2941,"is_contiguous":2942,"rms_norm_dynamic_per_token_quant":2943,"quant_dtype":2944,"scale_ub":2945,"empty_like":2946,"scales":2947,"numel":2948,"float32":2949,"awq_dequantize":2950,"qweight":2951,"split_k_iters":2952,"thx":2953,"thy":2954,"model_executor":2955,"layers":2956,"awq_triton":2957,"awq_dequantize_triton":2958,"awq_gemm":2959,"qzeros":2960,"awq_gemm_triton":2961,"gptq_gemm":2962,"b_q_weight":2963,"b_gptq_qzeros":2964,"b_gptq_scales":2965,"b_g_idx":2966,"use_exllama":2967,"bit":2968,"gptq_shuffle":2969,"q_weight":2970,"q_perm":2971,"marlin_gemm":2972,"b_scales":2973,"workspace":2974,"size_m":2975,"size_n":2976,"size_k":2977,"gptq_marlin_24_gemm":2978,"b_meta":2979,"b_q_type":2980,"scalartype":2981,"cutlass_scaled_mm_supports_fp4":2982,"cuda_device_capability":2983,"cutlass_blockwise_scaled_grouped_mm":2984,"scales_a":2985,"scales_b":2986,"problem_sizes":2987,"expert_offsets":2988,"cutlass_scaled_fp4_mm":2989,"block_scale_a":2990,"block_scale_b":2991,"out_dtype":2992,"ndim":2993,"cutlass_scaled_mm_supports_fp8":2994,"cutlass_scaled_mm_supports_block_fp8":2995,"cutlass_scaled_mm":2996,"scale_a":2997,"scale_b":2998,"implements":2999,"fused":3000,"mm":3001,"implemented":3002,"numpy":3003,"style":3004,"broadcasting":3005,"blockwise":3006,"extended":3007,"broadcast":3008,"rules":3009,"rule":3010,"extent":3011,"dimension":3012,"element":3013,"along":3014,"src_shape":3015,"target_shape":3016,"consecutively":3017,"expand":3018,"128":3019,"bfloat16":3020,"float16":3021,"massage":3022,"2d":3023,"cutlass_compatible_b":3024,"current_platform":3025,"is_rocm":3026,"compressed_tensors":3027,"triton_scaled_mm":3028,"cutlass_scaled_mm_azp":3029,"azp_adj":3030,"azp":3031,"param":3032,"cutlass_sparse_scaled_mm_supported":3033,"cutlass_group_gemm_supported":3034,"cutlass_sparse_compress":3035,"compresses":3036,"matrix":3037,